Revit 2027 API
FabricationAncillaryUsage.AncillaryWidthOrDiameter Property
 Width or diameter of required ancillary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AncillaryWidthOrDiameter { get; }
Public ReadOnly Property AncillaryWidthOrDiameter As Double
	Get
public:
property double AncillaryWidthOrDiameter {
	double get ();
}
member AncillaryWidthOrDiameter : float with get
Property Value
Double
See Also
Reference
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace